							Challenge Is Everywhere,What Inspire Your Passion.I strongly feel about what the pursuit of knowledge is my life.

											能够「放舍诸相，休息万事」，渐渐就能体会到「凡所有相，皆是虚妄」 -- 2014/11/07


all in on 所有的
solution is buried in my error clue context
out of prep.由于; 用…（材料）; 自…离开; 得自（来源）;

Your work is going to fill a large part of your life, and the only way to be truely satisfied is to do what you believe is great work.
And the only way to do great work is to love what you do.  -- Steve Jobs
工作占去了你大部分的生命, 惟一让你真正充实的是去做你认为是伟大的工作; 而干一件伟大工作的惟一途径是爱上它.


I believe I am.Born as the bright summer flowers.Do not withered undefeated fiery demon rule. 
我相信自己，生来如同璀璨的夏日之花。不凋不败，妖治如火。


You see, but you do not observe.
你看到了，但是你没有观察。
observant	善于观察的; 观察力敏锐的; 严守教规的;
impressive observation skill. And he is a great observer.
1 perspicacious 敏锐、有洞察力的
注释 Having or showing penetrating mental discernment; clear-sighted. 具有或展现出敏锐的心理洞察力；清晰的判断能力
You are a perspicacious observer, Mr. Wang.
2 perceptive 感觉灵敏；有洞察力；有理解能力
注释 Having or showing keenness of insight, understanding, or intuition. 具有或显示出敏锐的洞察力、理解力和直觉。
Our victory depends very materially upon his perceptive power.
我方的胜利极大地仰仗着他的洞察能力。
3 discerning 有辨识力
注释 Showing good or outstanding judgment and understanding. 具有良好的或出众的判断力和理解力。
Indeed, the growth of his business is proof of his skill at discerning what it is that consumers want to wear.
的确，他的生意越做越大，这便是他能敏锐察觉顾客喜欢穿什么的最好证明。
此外，还可以用sharp-eyed (目光敏锐、观察入微的)、quick detection (敏锐侦查能力)、rapid discernment (快速洞察力) 来形容水哥的观察技能。
客串了一下consulting detective(咨询侦探)，福尔摩斯再不能说他是“the only one in the world”了……

这种无所不能的人物就可以用 omniscience (全知) 这个词来形容了。
“Omni-”这个词根就是表示“全部、总”的意思，基本上带上它的词都是万能的……
比如 omnipresent ，无所不在的； omnipotent ，无所不能的。
1 Renaissance man 文艺复兴式的人物；博学之士
The term Renaissance man or woman refers to a person who is talented in many areas, especially the arts and sciences. Leonardo da Vinci, 
Michelangelo and Benjamin Franklin often are called Renaissance men. Renaissance man/woman指的是在各领域，尤其是艺术、科学方面，都才华横溢的人。
达芬奇、米开朗基罗、富兰克林就通常被称为这种“文艺复兴式的人物”。
2 versatile 具有多种技能、多才多艺、通才
Wang stands out for his incredible versatility as a designer.
作为一个设计师，王昱珩以其难以置信的多才多艺而出类拔萃。
3 A guru on everything
Guru 是专家、权威、领袖。A guru on everything，也就是在各领域都是专家。
Lu Xun has been a guru to many young writers.
鲁迅是很多年轻作家的精神领袖。
4 polymath 博学的人
A polymath is a person whose expertise spans a significant number of different subject areas; they are known to draw on complex bodies of knowledge 
to solve specific problems. 一个“polymath ”是具有跨很多领域的专业知识的人物。他们能运用各种复杂知识来解决具体问题。

形容这样的强大气场，除了 confident (自信) ，你还可以说， self-assured (自信的、胸有成竹的) 、 poised (泰然自若的) ：
　　Wang was self-assured and poised when he picked out a specific glass of water among 520 grouped together.

但他真的不是盲目自信，所以就不要用 conceit (自负)、egotistic (自高自大的) 、cocksure (过于自信而骄横的) 这种词啦。
　　不过当他说“我放弃观察”的时候，还是忍不住想说cocky（自命不凡）啊……

形容这种“王的蔑视”，除了 arrogant (傲慢的) ，大概还有 haughty (高傲的) 、 superior (优越感的) 、 patronizing (屈尊俯就的) 这类词……


2016/03/23


竹根精神：锲而不舍.厚积薄发。坚持.目标.忍性.分寸.求必然：坚韧不拔.坚持不懈，尽可能布局较大目标，严格忍耐.积累足够能量，严谨发力.延绵不断，
一鼓作气.追求达标的必然。咖啡厅总群：竹根精神群，稳健竹根型人才群。咖啡厅使命：自组织.打造众多竹根型人才。咖啡厅定位：微博群的西点。


2016/03/10


从自身错误找寻解决方案才是正确的途径

少即是多的设计哲学

管道理论, 像太平洋那么粗

拥有链接而不是拥有资源本身 -- 这句话本身说明资源在静止状态其价值难以得到最大化, 只有流动起来才能发挥其价值

封闭系统 						  <--> 		开放系统
静止状态, 资源耗散, 最终会消亡    <-->		兼容并蓄, 激活流动状态, 不断有新的活力注入进来

宽容失败
工程师文化
多元文化		一个团队中至少有一个第一代移民

2015/12/3


1. 云存储 -- 七牛, 腾讯, 阿里, 百度
2. https://www.mendeley.com/
	Mendeley is a free reference manager and academic social network. Make your own fully-searchable library in seconds, cite as you write, and read and annotate your PDFs on any device.
3. https://help.sense.io/
	Sense is a collaborative, scalable, and highly extensible cloud platform for data analysis, statistical modeling, visualization, reporting, and business analytics. Sense allows you to:

	Use the powerful data analysis tools you know, including R, Python, Julia and custom engines, in the cloud.
	Scale your analysis easily, without managing or investing in infrastructure.
	Share and collaborate on your data, code, and results.
	Deploy your analysis as reproducible jobs without complex deployment cycles.
	Sense is organized around 4 major components:

	Projects: a collection of files, interactive consoles, batched jobs, and models. Projects can have multiple collaborators with various access levels to these items.
	Interactive Consoles: these are live R, Python and Julia sessions for ad-hoc work and experimentation.
	Batched Jobs: once you feel confident about your scripts, turn them into batched jobs for automatic top-to-bottom execution.
	Models: an easy way to deploy your data models and predictive functions as REST APIs.
4. https://www.sharelatex.com/
	The easy to use, online, collaborative LaTeX editor
5. https://www.overleaf.com/
	Collaborative Writing and Publishing
	The easiest way to create, edit and publish your research.



2015/11/27

circle, thread 这些概念在外国人的工作中出现频率很高



2015/11/18


术业有专攻, 在一件事情上的持续思考;
人的记忆能力是有限的, 而且遗忘能力特别强;
根据相关的场景反复强化训练以对抗遗忘;


2015/11/12

没事干, 就给自己找点儿事干:
1. 学英语
2. 读文章[专业文章, 文学历史等]
3. 学习专业知识

能量耗损定律 - 注意力被过度分散会导致体内特别是大脑内的能量快速流失; 只有专注于某件事, 将其完成后, 再转移到另外一件事上, 才不会一直惦记着未完成的事; 而增加能量消耗.


2015/11/10


怎么判断自己对一件事情的想法是对的 ??
  而且很有可能第一次是对的, 第二次是错的; 或者反之;
  difference analyse 差异化分析 这是最基本的前提
  consolidate 把什么合成一体, 合并, 巩固; 加强, 统一;
  miscellaneous 各种各样的, 五花八门的, 混杂的, 多方面的;
  Counterfeit 仿制, 造假, 伪装; 仿造的, 假冒的, 虚伪的



2015/11/5

印度观感:
	持续不断的工作热情, 始终如一的认真态度;
	专业的开发技能等等都是我们远不如他们的地方;
	最让我惊叹的是他们的撰写文档的超强能力;
	能够在最短的时间内撰写完成一份专业的文档;
	再个就是把想法变成英语口语表达的能力;



2015/10/20


臃肿, 精简;  双向过程;

东西多了就要精简,
东西少了就易堆砌;


2015/10/19

发生联系, 美国民主共和两党; 中国革命早期从美国引进的政体制度



东西南北中 泰华衡恒嵩

泰山 山东 泰安
华山 陕西 渭南华阴
衡山 湖南 衡州
恒山 山西 大同
嵩山 河南 登封





2015/10/13

阐述一个事实, 经济学家的陈词会有很明显的经济学的脉络痕迹; 而大异于作家的生动奇诡; 要严格按照事实来剖析, 对于个人情绪的发挥是约束的.

马克思的经常学竟然是错的, 计划经常, 市场经济; 理论和实践, 真正的考察细节, 市场动向; 而不是


2015/10/12

静则生智


2015/9/29

人其实只要是自己感觉到对, 行为就会自然不呆板
独立思考, 一直都没有这样行动过, 更不别说养成习惯了


2015/9/21

找别人解决问题之前, 自己有没有百分之二百的努力去想办法弄清楚这个问题的所有细节及可能的解决方案?
跨部门解决问题看别人的那副脸色真不是滋味 --^-…^----^-^-----^-^------^-^-----^-^--

所有的壁垒都是可以被打破的, 人与人之间的壁垒在沟通过程中可能以一种激烈的方式被打破

2015/9/14

一个不成熟的男人是为了某种崇高的事业英勇地献身，一个成熟的男人是为了某种崇高的事业而卑贱地活着。	--- 塞林格

我也发现我活的很纠结啊, 为什么要这个样子呢, 拒绝平庸, 丢弃怯懦, 干掉自卑, 重塑自我

千奇百怪的对比, 形形色色的对比, 弄巧成拙地对比

消遣别人的痛苦来成全自己的卑贱的一时快意

随时都可以拿来进行倾压

每一缕贫瘠枯萎的灵魂总是在寻找另外一个更加宽广的坟墓来埋藏自己逼仄的躯壳


2015/9/7


英语听力其实很重要的一点儿就是场景再现法, 脑海中构建出谈话中出现的画面, 有时顺着一两个单词就能很快的进入上下文.
换句话说, 就是抓住谈话的核心话题, 就像高晓松说的那样, 英文里面有大量的辅助单词, 语气助词动作助词等不表具体意义的单词.

还有就是英语单词中大量的表示方向的动词, 介词等也可以转向领会语义



2015/9/2

不要轻易失了脾气, 容易发脾气的人是愚蠢的.
第一件背后都有深刻的逻辑和道理存在, 第一反应不是理智思考而是暴怒欲狂; 什么时候才会成长起来???


越南公益宣传片做的多优秀
不要把自己的眼光整天都局促在国内, 中国周边有那么神奇的国度, 世界那么大, 每天都可以接触很多新鲜的资讯
可以给你带来全方位崭新的体验



2015/8/31


为啥穷人家的孩子最后成都的很多, 所谓的知识分子的家庭培养出来的孩子却不见得对社会作出多突出贡献。
我想, 其中有一点儿就是, 父母的越俎代庖, 固执己见, 什么都按自己认为对的道理来约束自己孩子的行为, 久而久之思想也完全被奴隶了;
反之一个没受过什么教育的家庭, 环境相对轻松, 没有任何条条框框, 孩子的模仿独立精神得到极大的发挥, 特别是孩子接受的教育越高这种
效果越明显.




2015/8/18

care more, lose more.


2015/6/18


Latitude 30 degrees  北纬30度


Dawn of Justice  正义的曝光



2015/8/13

resemble	与…相像，类似于
aftermath	后果；余波；结果；劫后余生
blast		爆炸；冲击波；一阵；鼓风

Aftermath of Tianjin Blast Resembles War Zone	爆炸后的天津一片废墟

obliterate[əˈblɪtəˌret,oˈblɪt-]	涂去；消灭；除去；擦去






2015/6/16

愤怒, 仇恨, 歧视, 诋毁   -- 之所以有这些情绪, 根本还在于自己的能力不通达, 心胸不开阔, 被外物所牵制

一定要找出效率低下的根本原因, 彻底纠正之. 不然会耽误一生, 止步不前.


2015/5/18

张瑞敏：有人质疑，将企业变成自组织平台，会产生大量的内耗，不符合科斯定理。科斯定理是说企业是有边界的。企业边界简单的说就是交易成本，如果你的交易成本比别人的高，
你就不能扩张。但是科斯定理很重要的一点前提是，企业内部没有市场。因为内部之间每发生一次关系，就发生一次摩擦，因此没法变成内部市场，交易成本很高。

但科斯把企业看成孤立的，不是开放的。之所以内部存在摩擦力，是因为：一是有领导给你下指示；二是很多资源从内部来。如果没有统一的领导，资源从市场来，那么摩擦力就等于0。


2015/5/7


黄花菜 （学名：Hemerocallis citrina Baroni），又名金针菜、柠檬萱草，属百合目，百合科多年生草本植物，根近肉质，中下部常有纺锤状膨大。
别称：萱草、忘忧草、金针菜、萱草花、健脑菜、安神菜、绿葱花

虞美人/罂粟花
从整体上看。虞美人整个叶茎上都有那种绒绒的刚毛，而罂粟花的叶茎很少有刚毛，整体上比较滑腻。
从植株高度上看。虞美人整棵植株的高度大约在30-100cm范围内，整株比较细弱。罂粟花高度大约在30～150cm范围内，比虞美人略高，整体比较壮实。
从花瓣上看。虞美人的花瓣多是4片的，而且颜色各异，有红有紫，也有白色的，且花的边缘比较平滑不开裂。罂粟花有重瓣的，颜色以红色为主，花的边缘会开裂。
从叶上看。虞美人的叶子会有分裂状，而且整个的叶面是窄的。罂粟花叶子是不规则的，且叶边呈锯齿状，不分裂。
从茎上看。虞美人的茎比较细，以青绿为主，周围有绒毛，而且梢头会有所弯曲。罂粟花的茎比虞美人的茎要略粗，也有粉绿的，无毛且光滑。
从果实上看。虞美人的果实比较小，大约有1cm长，而且上面有绒毛，果实下垂，罂粟花的果实比较长，大约有4～7cm，果实外表比较光滑，果实直立。




2015/4/15

@陈启宙
【中国象征】
①麻将—象征中国国民，彼此算计，乐此不疲。
②象棋—象征中国政治，一切为保帅。
③围棋—象征中国思维，一切非白即黑。
④军棋—象征中国官场，官大一级压死人。
⑤杂技—象征中国现状，折腾来折腾去，都是为了维稳。
⑥武术—象征中国军事，架式吓人，没见制服过谁。



2015/4/10

焚寂剑


2015/4/9

真实和谎言一起去洗澡, 正在洗澡的时候, 谎言偷偷跑到岸上, 穿上了真实的衣服, 当真实发现的时候谎言早已穿着他的衣服跑的无影无踪, 真实宁可光着身子, 也不愿意穿谎言的衣服.
从此, 人们就只能看着, 穿着真实衣服的谎言, 却接受不了那赤裸裸的真实.


2015/3/26


伏兵百万, 千年诗词万古文, 作者事先构思整篇文章, 布局精巧, 能于绝境处峰回路转, 笔下气势万千; 虽着一凡笔, 却也能妙趣横生摇曳生姿;

直有神鬼莫测之功. 断然是一篇造化文章, 让人回味无穷, 心驰神迷

萌生, 造势, 蓄势, 喷薄, 落幕, 寂灭

人类发明各种容器, 是历史的必然; 其实应该是发现, 而不能叫作发明; 这个世界就是个大容器, 小到个体每个人, 大到宇宙空间
只有容器才足可以容纳万物, 其容积有大有小而已, 导致功能不一而同


2015/3/18

qq 一张表情对应一个成语
再抽象难捕捉的理论概念, 只要你愿意接受它, 在心理反复默念并尝试映射匹配一个尽量合理的现实场景或程序, 很快就能理解记忆的


2015/3/12


拖延症

【一张值得深思的图】没有行动，懒惰就会生根发芽！没有梦想，堕落就会生根发芽！时间越长，根就越深！
					到时候想站起来是件很困难的事。— — 拒绝拖延，拒绝懒惰，想要，就立即行动。与君共勉！

孤独的石头过不了河




2015/3/4

power cloaked simplify.  一次只做一件事. 简单就是力量. 简单就是美.

在工具程序的世界里, 没有消息就是好消息
你叫它做什么, 你就会得到什么


2015-02-09

coder checker
一个问题的解决伴随着一个新问题的产生
A solution to the problem is accompanied by a new problem.


2015-02-04

差异化记忆, 反差越大, 记忆的会越深刻!!!

一张白纸, 一般人看起来的确是一张白纸而已, 但有人就能从其中看出其它的东西来,  为什么?


2015-01-30

清晰化一件事情, 一个想法; 而不止于幻想中的模糊轮廓, 镜中花水中月, 这种若有若无的感觉; 不适合理性而现实的斗争策略的具体制定及实施; 很难实现突破超越的.
如果换在艺术创造层面, 这种若即若离的境界是维护高效创新能力的源泉, 这个胜在意境人的审美需求, 但最后也脱不了付诸作品, 神转形的过程, 还是要一个通透的方案





2015-01-21

每天都忘记那么多东西, 这是个很严重的问题; 必须强迫自己每天早晚回忆一下当天所做过的事情, 哪些是完成的, 哪些是未完成的, 按照优先级紧急性列出来. 分个轻重缓急.
每天都这样日复一日地机械消磨日间是对自己生命的极度不负责

自己一直都囿于某个狭窄的区域思考问题, 即封闭的小圈子内; 而不是习惯性的尝试跳出来到另外一个或相邻的圈子, 用一种崭新的, 交叉对比的, 跨越性的思维来重塑问题本身
方向不对, 努力白费, 教训深刻, 不知悔改.

无论什么事, 特别是自己陌生害怕的事, 必须敢于迈出第一步, 这样才有可能顺畅地继续走下去; 亚根儿带有畏惧心理是干不成事儿的.

2015-01-14

九宫格数独求解:

请按格式输入点信息（i行号, j列号 v值）,输入结束输入over: i j v
0 0 8
1 2 3
1 3 6
2 1 7
2 4 9
2 6 2
3 1 5
3 5 7
4 4 4
4 5 5
4 6 7
5 3 1
5 7 3
6 2 1
6 7 6
6 8 8
7 2 8
7 3 5
7 7 1
8 1 9
8 6 4
over
After 9X9 Matrix initialized:
--------┬---------┬---------┐
8  0  0 | 0  0  0 | 0  0  0 |
0  0  3 | 6  0  0 | 0  0  0 |
0  7  0 | 0  9  0 | 2  0  0 |
--------┼---------┼---------┤
0  5  0 | 0  0  7 | 0  0  0 |
0  0  0 | 0  4  5 | 7  0  0 |
0  0  0 | 1  0  0 | 0  3  0 |
--------┼---------┼---------┤
0  0  1 | 0  0  0 | 0  6  8 |
0  0  8 | 5  0  0 | 0  1  0 |
0  9  0 | 0  0  0 | 4  0  0 |
--------┼---------┼---------┤

The solution after processed:
--------┬---------┬---------┐
8  1  2 | 7  5  3 | 6  4  9 |
9  4  3 | 6  8  2 | 1  7  5 |
6  7  5 | 4  9  1 | 2  8  3 |
--------┼---------┼---------┤
1  5  4 | 2  3  7 | 8  9  6 |
3  6  9 | 8  4  5 | 7  2  1 |
2  8  7 | 1  6  9 | 5  3  4 |
--------┼---------┼---------┤
5  2  1 | 9  7  4 | 3  6  8 |
4  3  8 | 5  2  6 | 9  1  7 |
7  9  6 | 3  1  8 | 4  5  2 |
--------┼---------┼---------┤



1  [a]	2  [b]	3  [c]	4  [d]	5  [e]	6  [f]	7  [g]	8  [h]	9  [i]	10 [j]
11 [k]	12 [l]	13 [m]	14 [n]	15 [o]	16 [p]	17 [q]	18 [r]	19 [s]	20 [t]
21 [u]	22 [v]	23 [w]	24 [x]	25 [y]	26 [z]

甲、乙、丙、丁、戊、己、庚、辛、壬、癸
子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥
鼠、牛、虎、兔、龙、蛇、马、羊、猴、鸡、狗、猪

-- 每四个一组, 记起来还顺口, 而且其对应的下标顺序, 也很容易计算.


维度规律:

	一维的东西能够容纳所谓的零维（直线是由点构成）二维的东西能够容纳一维（纸上可以画条直线）；
	三维的东西能够容纳二维（盒子里放个纸片，但大盒子里也能装小盒子）；
	那么四维的东西就理所当然的能够容纳3维了。我们人体算3维的，身边的事物也是。这个世界也可以看做三维的，但是我们无法感知到容纳我们的四维。


2015-01-08

不做巴甫洛夫的狗，不做维特根斯坦的苍蝇，不做薛定谔的猫，努力做洛伦兹的蝴蝶

巴甫洛夫的狗
	用来形容一个人反应不经大脑思考，如意识形态的先入为主、对逻辑思辨的抗拒。巴甫洛夫的发现开辟了一条通往认知学的道路，让研究人员研究动物如何学习时有一个最基本的认识.
	所有这些都要归功于流口水的狗狗。著名的心理学家巴甫洛夫用狗做了这样一个实验：每次给狗送食物以前打开红灯、响起铃声。这样经过一段时间以后，铃声一响或红灯一亮，狗就开始分泌唾液.

一切理论如果没有事实支撑都是是谬论.
所以用心发现事实细节积累生活经验会很重要.


2012-12-31

牺牲旧我, 铸就新我.
零星断点, 妄自成线.


2014-12-29

识实务者为俊杰
读书破万卷, 下笔如有神	-- 讲的不仅仅是量多的问题, 而最核心的在于那个「破」字, 即要把书读破为止, 烂熟于心有自己的见解, 这才是其真实的目的
	这就告诫我, 对于一本好书, 不要报想, 只读一遍, 就完事了. 而是有所领悟, 有所立意才行
	这貌似是一种最笨的方法, 但却也是最有效的方法. 而一旦积累到一定的量, 那么就会有质变了, 后面就会很轻松了

我为什么一直强调要返本归源, 其实一直一来都在重复犯一个错误, 好大求全搜奇拣怪而忽略了一切的基础, 无论如何延伸演化都要遵照这些颠扑不破的物理法则. 而所有的变化只是外在形态而已.
为什么人们说万丈高楼平地起, 根基越扎实高楼就经得起风吹雨打.



2014-12-26

一鳞半爪浮光掠影式的浅尝辄止加上漫无目的束手就擒般的宿命
下笔如有神助行时而抖擞莫怕无处惊风焚天一寂而盖万物成飞灰

一个十足的呆子傍着无家可归的灵魂流浪
哪来那么多成捆成捆的情绪有一沓没一沓的袭来裹着干瘪地躯壳流浪在莫可名的街头

看着那只莫名而惊怪的小虫子拖着晃动的脑袋向我袭来
是谁在侮辱我的智商无他唯孤一人而已

能不能封装一个考虑边界及所有细节的类时刻警醒自己哪儿未念及到呢


2014-12-25

匪兽之徒, 莫可与之争, 暂避其锋芒;
有价值的坚持和无价值的坚持, 有价值的勤奋和无价值的勤奋, 我能够区分吗?
今天坚持了, 一觉醒来, 明天又重新回到老路上去了; 继续犯错, 重复犯错, 这些才是问题的来源.
正确的优秀的素质也不外乎那么几点, 但是真正能够养成习惯坚持下来的, 少之又少, 一看到别人成功了, 就把原因归结为是天才; 难道我现在也还作这样想吗?
如果这个世界上的确存在天才, 那么我不相信. 我现在只相信实际行动加上变通法则.


2014-12-23

依赖性太强了, 什么时候能独立起来? -- 不确定性, 不安全性, 有限的认知导致的这一切? -- 盲目乃至盲从进而狂妄.
如果你掌握了我所掌握的一切信息, 你一定会相信我的观点的.
信任升级理论 -- 承认错误的后果仅由自己承担, 规避错误的后果会加到所有人的身上.


2014-12-22

解决最后一公里的问题. 或者是没有坚持到黎明到来的那一刻就挂了 -- 从而暴露出来自己知识上的漏洞很多, 不能周全考虑各种细节, 虽然整体能走通, 但往往卡在某一个点儿上.
最大的毛病就是自己的程序从来没有彻底调试确认无误就给qa测试了 -- 自己现在还没有能力保证写出来的代码正确无误.

我想的太简单了 -- 本来除夕那一天的 G571 票我是可以买到的, 但是我还在侥幸能抢到提前一天的票




2014-12-01

玩偶可以影响孩子的性格及未来发展方向, 这些微不足道的细节, 都要引起家长的注意
雷声大雨点小, 口惠而实不至
雅典 罗马

2014-11-28

遥遥天涯判死生, 近近咫尺索命魂. --- 鬼王棺 诗号 <霹雳布袋戏>


2014-11-19

胸有沟壑, 容纳万千. 而不是一味被某种毫无理性的情绪左右



2014-11-12	--->

每一个古怪的脾气背后都有一段难为人诉说的悲壮故事，陌生人还未能靠近便已远离，更遑论深入的了解认识，而这类人群往往有着惊人的才能和功力，其见解
经验在各个层次上都远超同类了，而自己却也一根筋意志薄弱地被其声势震慑敬而远之了最后也不了了之了。到头来什么也没有学会。有很多事,经历并不是每个
人都会遇到的，但是听别人的故事见闻却能无形中增长自己的阅历。有个核心的关节就是，必需经过自己的反复咀嚼,反刍沉淀，才能转化成自己的东西。不然这
一切都只不过是浪费时间的浮光掠影惊鸿一瞥罢了。什么才能让自己记忆的深刻持久，唯有痛点，激活神经，开化潜能，才能有一二希望。

【平凡之处的井底之蛙盲人摸象固执己见，不落窠臼推陈出新高屋建瓴进退有度伸缩自如】

其实普罗大众的生活都是极尽重复一样没有人能免俗，爱恨情仇，嗔痴妄贪，六根不净，此遭即逝，彼遇即始，如此往复循环，不可止歇。



2014-11-11	--->

其实吧，在linux下进行命令的操作时，无论是 grep , find, cd, ls, ll, rm, mv, cp, tail, head, sort, diff, pwd, ps, cat, echo, wc 等等这些，
还是数据库的操作 insert, update, query, delete 这些增删改查的功能，在功能需求上是一样的，同样的道理，同样的概念，把它们扩展运用到相似的
情境中去，只不过一些细节上操作的差异需要特别注意罢了。
		【这其实也就是所谓的 「做减法运算」 的一个典型运用】

	而且在linux中有一种设计哲学，一切小而巧且美，却又统一【反向指令和正向指令匹配的情况】


2014-11-07	--->

	【其实说白了，一切问题的根源还是在于人(当然我排除了不可抗拒的自然伟力)，而人的根本又在于心，心感受到的东西直接决定了这个人的境界】
【凡所有相，皆是虚妄】
		【每个人都是有能量场的，所谓气质，不过是物质化具体化的一种存在形式而已】
 【能不能把佛家的归于内化的，而科技物质世界的改造创新进步归于外化的。他们并不分离，而是统一，由于认识的局限导致我们分裂的看问题。动线】

	修行，就是要练习着用佛的角度来体验生活，因为我们还没有开悟，没有智慧，没有办法像佛一样。特别是在家居士们，有家、有孩子，也有很多的责任，
	房子被烧是个非常现实的大问题。而我们出家人大概好些，这个庙烧了就到另一个庙去，不过在西方社会也不是这么简单，其它的庙并不一定会随便接受。
	所以只有学佛，练习着了解自己，化解心中的苦恼及牵挂，能够「放舍诸相，休息万事」，渐渐就能体会到「凡所有相，皆是虚妄」。但还是要很细心的
	照顾、运用这些虚妄相，自利利人是要从有相开始，体验无相、体会无相，然后才能实证无相。

2014-11-05	--->

	【学会做减法，而不是处处运用加法，太累】


2014-11-04	--->

	任何成功都隐藏于细节之中，只有以审慎严谨的态度，坚持不懈持之以恒地韧性，灵活多变且明察秋毫地眼光来捕捉足够多的琐屑，并从中抽离出层次分明逻辑谨严的方案，洞悉其本质规律并赋予其具体模型，以实际效益衡量。
	好高骛远，喜大求全，永远一副志得意满，不可一世的欺人脸孔，是为下人。
	有几条线，明线暗线，主线辅线
	有几个层次，上层下层，内层外层
始终，首尾，中间处理过程，量变至结果输出
	所谓宿命论，我自认为这样解释更加合理，那就是必然性，没有第二种可能，一定会发生，只不过是作用于其中的条件不同，导致经历的状态有异。关键就在于这个条件的创造。

	有几种境界，小我之境，被困于一处，跳脱不出来，纠结的境地;
				晦明之境，偶有开悟，却未能坚持，大多放弃，或许一辈子就这样了;
				通彻之境，于关节处能有顿悟，势如破竹一鼓作气，终有所成。

				【万事开头难，且行百里者半九十】
	【大胆假设，小心求证】
			【兴趣是最好的老师】
				【别觉得事小，就懒得为之，今天不做，明天也放弃了，积累就是一辈子，失去的也是一辈子】
		【看问题可大可小，如果自己的心态放得可小，看到的东西就十分局限，狭隘; 如果心放得很宽，就像一个容器其体积变大了，自然接纳的东西也就多了，也就更灵活了】
【存在即合理--自己的理解或许就是其现象背后有逻辑，有内容，这个是前提，我的工作就是要定位到正确的地方】
	【就好像是在不同的情形下要运用不同的语言一样，向不同的人传达同一样的事情，要想表述明白，需要运用不同的语气和措辞是一个道理的】

	自我认知，是不是在讲自我特性下的自我需求及满足，实现。那这里要涉及到途径了

2014-10-31	--->

	每个指令操作之后，每一个动作完成之后，都会有相应的结果反映出现，或许是你想要的正常的，更多的是你所不想要的，预期截然相反的。这个时候需要的是冷静的分析，而不是盲目的去浪费时间在一些
	毫无意义的后续行动中，它们之间都有很深的联系，找到之间的关联，就很容易找到解决方案了。百分之九十的时候，都在重复的犯错误，不够冷静，不实际验证分析。这里就运用到图解了，思维导图里面的
	图像关联分枝发散，一句话，或是某一个字，描述是一幅图，日常生活物品，天气地理现象，诗词歌赋，

	【以字换图 - 以图释图 - 以图换字】

	武 -> 斐(非文) | 刃 -> 召 | 熙熙攘攘 -> 侈 | 雨 -> 池(水也) | 关羽娶媳妇嫁女儿 -> 关门大吉 | 一一入史册 -> 更 | 半导体 -> 付 | 一半在天上一半在水里 -> 鲁

2014-10-30	--->

	【反指令】=====【问题的反向】


2014-10-28	--->

	无意中给自己制造了一个死循环，冥冥中意识到如果没有外力的干预，里面的中断条形是不会被惊醒的。
	【面壁思过 一年】

2014-10-23	--->

	在解决一个问题的过程中，可能会伴随着其它的问题的诞生。如果当时不记下来，很有可能会成为潜伏的炸弹，这就告诉自己不能存有一丝侥幸心理。
	任何一个可疑的分枝都应该测试到。

2014-10-14	--->

	最大的教训，特别是拷贝过来的代码也要一行行的看明白，是咋回事，是啥意思。

2014-10-08	--->

	bring sth to its knees 把某物拖至谷底


2013-12-19	--->
褚时健
吴胜明
70多岁创业,为时不晚

敬重有梦想和理想的人

2014-09-04	--->

	他终于肯定下来！

    太初消失前，以灵魂、肉身、精血淬炼万物生灵，太初时代的荒、鼋、噬统统为太初的部分凝结而成，太初洞悉所有奥义真谛，为宇宙规则制定者，他分裂以后，荒、鼋、噬的灵魂印记中，或多或少烙印了他的奥义记忆。

    所以鼋出生就是水之生灵，噬天生懂得吞噬和八大邪力，紫耀深明神光奥义……

    世间万万生灵，都是太初创造而出，好比荒凝结不死魔族、冥皇族、天妖族、神族，噬凝结噬族一样，太初创造了万物生命……

    亿万生灵存在的天地，浩淼宇宙，为太初本身的域界，由于太初力量的强悍，他的域界也是无穷无尽，囊括万千小域界，广阔无垠。

    太初之门，就是脱离那域界的窗口，奥义符塔为钥匙，穿透太初之门，就是离开了太初创造的域界，从那域界层下来，进入了他的奥义层。

    众生修炼的所有奥义，都来自于太初奥义层的奥义本源，若能融合本源，就是一种奥义的规则制定者，为难以磨灭的神印！

    此地为奥义层，奥义规则的源头，域界层下面的天地，那么更下方是什么？

    识海层！

    “下面肯定还有一层！识海中必有魂潭，太初的魂潭！老天！是什么将两层隔绝？空间？空间奥义本源？”

    石岩轰然一震，他看着脚下的虚无，脸色突然变了。

    奥义本源固然珍贵无比，但如果他猜测属实，那么脚下虚无深处，应该还有一层，太初的识海层，识海层还有魂潭，太初最澄净的魂能，也就是能孕育生命灵魂的暗能，世间最神秘的能量！

    太初的魂潭！

    一连串的念头，在他脑海中掠过，他深吸一口气，坚定信念，相信自己的猜测，往虚无下方沉落！

    他坚信虚无之下，必然有东西存在，他要看看底下到底有着什么。

    这具本体，舍弃星辰、生命、吞噬、八大邪力之后，也舍弃了副魂、奥义符塔，只剩下纯粹的空间奥义，本体内流转的能量气息，也都是空间的奇异波动。

    或是他的纯粹，待到他运转空间力量，他这具本体如穿透层层空间，以无人能及的速度，坠落向虚无最最深处。

    沉落！不断地沉落！坚定不移的沉落！

    也不知道过了多久，或许一霎，或许数万年，他突然灵魂震颤！

    他感受到了最纯粹的空间气息！

    脚踏实地的感觉，也在这一刻映入心头，他垂头一看，脸上浮现难以置信的狂喜，禁不住大笑起来：“果然如我猜测！”

    脚下，为一片辽阔无垠的镜面，那镜面没有尽头，如充斥虚无每一个角落，将这奥义层和下方的识海层给隔绝开来。

    这就是空间奥义本源，一面巨镜形态的空间根本！

    上面为奥义层，下面为识海层，如那太初之门一样，隔绝了两个层面。

    “一味的寻找，果真不如多动动脑子，功夫不负有心人！”

    大笑声中，石岩的本体，释放出纯净的空间波动，慢慢融入脚下的空间明镜，和最根本的空间奥义融合。


2014-08-26	--->

	民族性格。日本和中国，日本是一个严谨认真低调务实创新的民族，中国是一个弱势又狂妄倚老卖老而又止步不前的民族。
	什么时候能够低下头真正的向日本学习，正视自己的缺点不足，才有可能跻身世界一流强国。
	这和人与人与之间的关系何其一样。

	某天穿衣服发现，上面沾上了机油，当时直接认为是上地铁时碰到门边上导致的。直到今天早上，在家里发现另外一件衣服
	也沾上了机油，黑乎乎的。检查了一下挂衣服的地方，看见自家门缝处合页转动衔接的地方打了机油。
	这件事说明，你眼睛看见的第一事实不一定正确，或许就是自己一厢情愿自认为的，感觉还挺合理的，就真当成事实了。但
	是当同样的情形在另外一种场景下再现时，得出的结论会完全不一样，甚至否定了你之前一直认为的【真理】，还是一点，当证据
	不充分时，我自己可能会暂时找一个能说服自己的理由去使自己相信，就是这回事儿。

	今天从家里走时没有带背包，导致一些不习惯，首先就是刚出了家门突然意识到公交卡没有带，虽然钱我单独取了，钥匙平时
	就养成离开时顺手扔口袋的习惯，可还是会在这种情况下，习惯性遗漏掉一些重要的物件。因为曾经有过惨痛的经历，忘记带钥匙
	花了一百块钱开了个门。就一直在想如何解决这个问题，虽然在某一阶段可能很少再犯糊涂，但之后还是会犯，不能根除掉。
	经过反复思考验证，最根本的是自己的思维习惯或者是行为习惯出了问题，未能形成一个【严谨自证弥合封闭的逻辑】。其实无论是从
	某个点上出发，还是从某条线出发，或者直接从全局出发，都能推演出相关的核心重要的其它细节。只不过我的思维未能这样训练
	没有给再多的一分钟，再深入一点儿，再关联一点儿。看似无足轻重的一个环节，其实直接影响到办事的效率及结果。
	Give me one more minute!Wait for one more second!



2014-08-25	--->

	生动活泼的语言。浅显易懂的道理。引人入胜的细节。栩栩如生的实例。
	什么时候我能够放低心态，空掉一切，不耻下问，就是真正地成长了。
	一无所有，还目空一切，咄咄逼人，言辞激烈，情绪失控，这是弱智的表现，不承认自己的缺点，不从根本上认识，是不能彻底正视自己的。
	否定自己的缺点，积极改造。
	惶恐失措，与经验的缺失，环境的陌生，心理的怯懦息息相关。
	而这些无聊的行为举止，心理弱势，莫名其妙地逃逸出来干扰。

2014-08-22	--->

	just do some more little changes to bring your brain brand new ideas.
	everyday give myself one question, think twice, from different perspectives.
	编程中的一个好习惯是，有始有终。你声明了一个变量，用完了，记得清空。特别是 inputstream,connection, 这些都是需要关闭的。前后照应，是为一个小循环。

2014-08-21	--->

	处处都应该统一思想，实践运用。
	反证法的典型例子，反诘，反问法。
	我心大的这一论点。凡是个人，敢问谁想默默无闻，谁想一贫如洗，谁想卑微招欺; 谁不想富甲一方，谁不想美名远扬，谁不想封官进爵。
	从小到大受到的是什么教育，考试拿第一，否则没有奖励; 向成功优秀的人看齐，绝对不能和地痞流氓混在一起; 熟读诸子百家唐诗宋词，绝对不能玩物丧志。
	而如今，长大了，稍微有一点儿进取的想法，行动，就被说成是大有野心，一副很反感排斥的样子。而从来不知道去过问别人的失败曲折的努力过程，也许心是
	大的，力量却是微薄的，根本不足以支撑起。而是个人，即使在其狭小的圈子里，不也殚精竭虑地鹤立鸡群吗，你甘于平庸吗？
	很大程序上来说，是个体的悲哀，更是整个民族教育的悲哀。从上至下传达的都是高大全的理念，从来不弘扬小巧美的生活。从统计学的观点来看，15亿中国人，
	处于上游社会的人有百万人？他们都干什么，统治别人，寄生式结构。穷人或者是低层没有话语权的人，只有无私的奉献劳动成果。个体的梦想，追求得不到表达
	实现。无辜的人残害无辜的人，可怜的人嘲笑可怜的人。阻力其实在根本上不是来自于上层，而是来自于我们个体。个体与个体之间的这种无谓伤残是致命的。

1000，0000 / 15 0000 0000   1*10(7)/15*10(8)

2014-08-20	--->

	一段代码有自己的生命周期，一件事也有自己的生命周期，一个人也有自己的生命周期，万事万物皆有自己的生命周期。
	只不过目前处于哪个阶段，什么程度，以何种途径方法来考察乃是根本所在。横看成岭侧成峰，远近高低各不同。不识庐山真面目，只缘身在此山中。
	Different Perspective.
	当你不在问题的中心时，在问题的边缘时，是否会有意识地进入问题本身。


2014-08-15	--->

	被需要


2014-07-01	--->

	为什么自己还是控制不住自己的脾气？？？
	我为什么会有这么大的脾气？原因最根本的原因是，无知幼稚。

	狂妄自大
	目中无人
	一意孤行
	心浮气躁



2014-06-09	--->

	我到底是怎么了，动不动就控制不住自己的脾气，这样不仅伤害了别人，同时千百倍的伤害了自己。


2014-04-24	--->

	酱子瘟
	牛血



2014-04-18	--->

	走得太急匆，忘了回头，看看走过的路，以及最初的理想目标。初心不改。

2014-04-15	--->

	跟着感觉走，有很大的陷阱。适时以及时刻保持理性思维，才能生活得好。

	开会时，按优先级列出：
	1.	迫在眉睫必须解决的问题，一定要抓住关键点去靠拢自己的问题，有问题就要及时发问
	2.	积极听取别人的讨论观点
	思路要跟上节奏，开小差的时间是没有的

2014-04-11	--->

	弟子问：师父您有时候打人骂人，有时又对人又彬彬有礼，这里面有什么玄机吗？
	师父说：对待上等人直指人心，可打可骂，以真面目待他；
	对待中等人最多隐喻他，要讲分寸，他受不了打骂；
	对待下等人要面带微笑，双手合十，他很脆弱、心眼小，只配用世俗的礼节对他！你受得了何种委屈，决定你能成为何种人。

	上面的这这种观点本身就有很大的歧视性，不平等，非公正的意念。绝对是世俗中心机很深的人借佛宣扬一已之言，看似很正确。实则相互矛盾。

	男人要敢于担当，有胸怀气度，具备临危处变的能力，宠爱妻子，经营家庭，教育子女

2014-04-01	--->

	这是一个没有结束条件的死循环，除了浪费时间和资源之外，没有任何产出和收益。

2014-03-24	--->

	为什么我们的幸福不能由自己决定，而要由别人决定，别人的看法，言语，比较！！！


2014-03-20	--->

	烟波浩淼

2014-03-17	--->

	关系互动法, 抓住关系, 进行互动, 非静止.

2014-03-14	--->

	不能等，等就意味着坐以待毙，就是缴械投降
	不止步于看风景，听故事的人，自己要成为那道风景，或故事的主角。

2014-03-12	--->

	反向思维  镜像映射  生活中的真实例子
	浪潮之巅 吴军

2014-02-27	--->

	互联网布局：
	百度：去哪儿
	腾讯：易迅/京东，大众点评，搜搜/搜狗
	阿里巴巴：携程（恰谈），高德地图

	我是一个一旦有挫败感，就选择放弃的人！
	人害怕的就是改变自己！
	虽然也读了别人励志的传记，于己却未能有丝毫的改观，一如既往的度日如年。其中一点就是，看完后，从来就没有思考反省，行动改变过！不能真正融入到自己的血液，成为一种精神力量，引示自己！

	贤人争不是，愚人才争理

2014-03-03	--->

	古镇已逝海茫茫，新镇未成泪行行。沅水河殇

2014-02-26	--->

	欲扬先抑   欲擒故纵		先贬低自己，拿自己开刷，最后又把尖锐的矛盾推给对方。难道这些笔法，手法，用在现实生活中就是所谓的轰动效应，吸引法则？

2014-02-25	--->

	愤怒是潜藏在自己身上的隐形杀手，随时会出没到任何场合情景之中。
	行动迟缓，办事拖沓，注意力分散，间歇性遗忘，是消耗掉自己激情和专注的病源。

	梦里挑灯看代码，却遭遇一堆尴尬。不知道是哪位奇葩，演绎了真多优雅。待到千行未尽处，又引来条件分枝无数，再整循环断点横竖。莫名其妙注释，欧西神马文，揉碎眼睛不甘，奈何不是繁体化成茧。

2014-02-17	--->

	烟花烂漫惊艳了天 音回寰宇响透了顶 月影婆娑晃晕料地 灯笼高挂照亮了心

2014-02-13	--->
	杜子健：
		营销人，我们都要重视一个比较特别的购买现象-----伪需求购买（也就是自己实际上不需要，但以为自己很需要的那种购买行为）。我最近在研究一个新课题，
		《伪需求中的购买矫正》，就是研究和揭示大家如何花冤枉钱的。中国人越活跃矫情，所以，“伪需求”就越来越多，就如皇帝活到无聊时，一定会追求灵丹妙药
		以求长生不老。但其实，长寿村都不在皇宫，而在农村地区。所以你看虫草啊、血燕窝啊、千年灵芝啊，都不是长寿之本。其实，伪需求就如王老吉一样，它解
		决的不是“上火”，它解决的只是“怕上火”。一如“胶原蛋白”和“草本精华”一样，其实我们不懂“草本”的本意，但懂不懂不重要，有了这个“概念”我们就会想傻逼一样地去购买。

2014-01-22	--->

	执著于渺小微乎的想法,坚持千回百转的重思,力得山穷水复的转折,迈出生死攸关的一步
	好想沐浴在一种古老的宗教仪式中

2014-01-16	--->

	活着就有希望！坚持就是胜利！
	睁眼看世界，多元的世界，为什么非要固守住自己的这片狭窄的空间！去那荒凉的塔克拉玛干沙漠，去那与世隔绝的古村落，去那无人问津的渡口，去那寂静无名的山峦险峰。。。

2014-01-03	--->
	我今天又反思了吗？反省了吗！

	一切不经过自己的反思的东西，就永远别想拥有它支配它，而且一定要深刻反思总结，沉淀下来才能有长足的进步！

	动态管理线的概念，要知道这会帮你省了好多麻烦！即使自己的记性不好，但可以借助科学有效的方法来减少浪费和损失.

	“黑暗森林法则”是说，宇宙中的每个文明都是带枪的猎人，其他文明都是永恒的威胁，任何暴露自己存在的文明都将很快被消灭。而在互联网，尤其是中国互联网，
	黑暗森林法则被演绎得异常生动。除了SP、色情、黑客，法律也绕不过这片黑暗森林
	一块历经风霜的石碑，刻记着岁月光影的流转

	我的感情太过泛滥，从来没有理智过;让别人不爽啊，恨呀，骂啦！为什么自己慢，而且慢得那么多？因为自己从来没有反思自己做事的风格有问题？拖沓,散漫。
	注意力分散，精力不在正事上停留！想问题，不能一步到位，而且不能深入思考！太过于用感情支配自己的行为，不能冷静的思考分析权衡，怎么会不失败！要看到
	过时的东西就是落伍了的，不要再抱着不放了！调整思路， 以一种新的姿态，重新上路。独立思考才是王道！被别人指挥着走，想，这不是别人的附属品吗！
2013-10-30	--->
1	雾霾又倾城
2	歪斜，扶正
3	看来不仅仅是我有这个贱毛病，别人和我一样，都有！那就是，总是能在别人激情澎湃洋洋自得之时，发现其弱点，然后一盆冷水浇上去。。。
2013-10-23	--->
1	感觉在翻译英语句子或文章时，结合【上下文语境】，去理解其意思，是很准备快速的;还是就是你可以一种颠倒的思维去翻译;还可以根据生活经验，生活情景去猜测其大概意思。
2	独立思考才能获取独立人格

2013-10-22	--->
1	为什么总会被人打败，除了自己的实力确实不够之外，还有就是一点，无意识的被别人身上的力量牵引，从而丢掉自己的立场。你一直以来就是处于被动，在一个小点儿上思考事儿
	从来没有把眼光舒展开来，再开阔一点儿，大局一点，跳脱一点儿，这样或许就能看到另一番景象。
2	路标的作用，指导人向着正确的方向行走，有一种正确的行事规则在里面;也有一种行为习惯的引导性在其中;还有就是一种提示性的启发的信号在里面。我也要构建自己的路标，这种路标
	将会起到一种积极的暗示作用，引领自己向着预定轨道行进，在你没有方向的时候，在你软弱的时候，在你困顿的时候，记得有这样一些路标，坚定自己的信念，行动起来吧，不再犹豫。
3	不要把你的坏情绪引渡到别人身上，那是一种犯罪;要让别人在快乐与阳光下生活，善的力量。
4	突然就发现了一个有趣的现象：舒雷 相利 金喜梅 白梅 何成财 解亚博 于淼 郭金海 董朝辉 苏峰 邱丽萍 钟超 赵鸽 秦耀庭 杜萌 罗强 郭国振 杜卫卫 陈胜国 戴会男 马婷婷 庞金兵 孙玉江 高强 张黎 周锐敏 杨宋 崔腾飞 沈正 占林
2013-10-21	--->
	攻城狮	程序猿
2013-10-18	--->
1	在这样一个黑白颠倒，是非不分，善恶倒转，真假难辨的时代，你只能做到不怒，不愤，不悲，不动，才能心平气和地去思考

2013-10-16	--->
16  技术无贵贱，不要挑食
	小心“我会在需要的时候再学”
	广度的知识是深入研究的副产品
	和高手工作
	对技术的热情就是不给自己找借口
	挑战无处不在

	人生往往会面对很多选择，陈皓告诉广大程序员：
	户口、薪资，相比你的人生经历，你的眼界，你的发展，什么都不是
	眼界和经历最重要，价值并不仅仅是名利权
	和有激情能做事的人做有意义的事

	在最后陈皓给了大家三个思考：=== :》
	早晨，是什么驱动着你开始新的一天?
	你现在正在经历的有没有让你感到兴奋?
	你经历过的有没有让你觉得没有荒度?

15	你没有能力就想着整个天翻地覆，有能力了，岂不要毁灭整个宇宙;做人的思维可以很复杂，但千万记得不要太张狂，目中无人，一极而终！
	程序猿，攻城狮，挨踢民工
14	俞敏洪 致青春 	青春其实跟三个“想”有关，叫做理想、梦想和思想。
13	工具就是拿来用的，或许我并不必要每次都关心其内部构造如何，这样可以避开很多问题;可以提升开发效率。
	有些工具涉及到核心问题，有研究的价值，那我们不妨潜心探索一番
	事情不在正确的轨道上运行时，会出大错了，控制不住的局面必然到来。。。
12	北三环园子里奏响了史诗般的合唱;南三环林子里叽叽喳喳的小鸟却闹个不停
11	分类比较清晰，导致一些数据的冗余;有时自己分类不清，似乎也达到一种简洁，自己很明白，逻辑也没有错，但别人调试起来会很费劲;
	这两种情况的存在，各有优劣，显然前一种较胜。不过寻找一种折中的方案会更好。。。脑子不清晰时，是不会朝这个方向去想的。程序员编程时应有的一种敏感及良好习惯，这也是区分新手和老手的地方呢
10	要不学，那你就要玩得开心;要学，就要拿出十二分的激情来，有所反思，有所收获的学;要让时间过得充实，有价值
	寒霜易降，野露难眠
9	蝴蝶梦	武侠梦	知识分子的傲骨侠骨	活在自我陶醉的迷梦中	是有那么多好经典的传神的优质的深厚的超越了某些东西的不可模仿的古人的已经积淀了的亘古不变的精神本质的文化精髓基因传承了
	却没有去发掘借助现代科技和特效，外在的形式变了，是满足人心理的需求，内存的伟大的东西如果丧失了，再美也会遗失
	你不去做，你的子孙后代不去做，总活在自欺欺人的满足优越感中，被别人借鉴去，盗窃去，以另一种恢宏的大气的史诗般的内容画面去征服了世界，而不仅仅是自己人
	大唐何以成为世界的中心	今天的美国或许可以窥其一二
	江湖	森林法则
	各种思想流 意识流的一种激荡 需要各种知识，见闻，经历来激发碰撞
	你的价值就是与众不同，全新的自我，该如何重塑，如何开始，寻找不同的方向，不同的感觉
	看有道云笔记如何消除消息怪兽
	商战的背后有哪些逻辑，一次国企与民企的交锋，一次垄断与自由的碰撞，一次开放与禁锢的较量，市场不能由某种单一的力量去主导，否则会失去其应有的活力和价值，自由和公正
8	中国移动-大象，移动速度慢，转向迟缓;而移动互联网公司求新，求快，求变;不作出改变，只有死路一条，顺应时代的大潮流，才能有所作为;这是一个移动互联的疯狂时代，弱肉强食的时代;需要疯子的存在，非洲
	草原法则，有没有灵敏的嗅觉，有没有矫健的身形，有没有强大的力量，有没有足够的智慧，都决定着你先人一步还是慢人一拍，得意，失意，就这么个逻辑
7	不仅仅是，而且会是;能行的更远，为何要固步自封
6	深海孤独，蛟龙腾渊
5	道和术的逻辑，满眼看到的都是术，乱象了你的视野，混浊了你的记忆;其实隐藏更深也最为玄妙的当属道，道法自然，道生一，一生二，二生三，三生万物，这才是根源。如果想问题能有这样一个思维情景，似乎又
	清晰了更多。。。
4	现在能把一个问题讲得那么清晰明了的人物，似乎已经很少了，然而就是很少的这批人成就了大师，牛人。。。
	一个问题的前世今生，来源归去，探究的如此详尽，预测的如此精准，当佩服欲绝
3	每当走到这一步，回过头来，其实发现一个结论性的东西------那就是问题越讨论越清晰，越分越细，越思考越明白，分化有时看来是一件很有意义的事情
	让我想到思维导图这个工具里面隐藏的某些含义，似乎也在此吧------那种爆炸性的，发散式的，看似毫不关联的，总会找到一个因缘起点，有趣的是你不曾相信的事物或者逻辑出现了，
	它们在某个点上交叉碰撞出火花了，一些新鲜的事物到来了。。。
	有时候，人类社会所谓的阶级分化，君君臣臣，高贵低贱这些罪恶的毒瘤，在万事万物身上都有其体现，是根植于其基因中的，剔除不掉的东西，只有接受，趋利避害，积极作为
	是也，编程中也可窥其一斑，在不同的场景中，各组件之间要想协调一致的工作，必须各司其职，分工明确，谁被谁控制，信息流交给谁处理，是不能乱掉的，惟如此，方能程序运行稳定，实现一个大圆满，大和谐
2	清除缓存这一操作在代码里的位置及时机不对，会带来很多意想不到的问题
1	假设 + 条件分枝 = 思考过程 【假设充分不充分，有没有根据？条件分枝清晰不清晰，全面不全面？】


2013-10-01 before	--->

 *	一	条分缕析
 *	二  凡事都有分枝,脉络,能否用心,专心剖析,把其来龙去脉,看清楚,是一个人最基本的能力
 *	三	分的思想 - 微积分 - 阴阳论
 *	四	有时一叶障目,却易执迷不悟;不识庐山真面目,只缘身在此山中;有跳出某个点,看整体的意识
 *	五	研究一个所说的话,很有意思;三句不离老本行,所说反映其所思,更反映其所长;太多人都在讨论对别人的看法,而且一本正经,仿佛自己是专家权威
 *	六	当然有些人喜欢谈论赚钱之道,谈自己如何厉害,如何鄙视别人的无知无能,没有远见思考
 *	七	只要稍微用点心,朝别的方向考虑一下,就会有新鲜的发现
 *	八	有人喜静,有人好动;有人喜欢吹嘘,有人保持低调;有人激情高涨,热衷于玩弄权谋,与人争与已争;有人看不透世俗,却被卷进权谋,沦为棋子
 *	九	人与人的交往已经不再单纯,必有利益驱使;奸诈阴险之嘴脸暗藏其后;防人害人之心常有之,暗箭冷雨防不胜防;
 *	十	你不以小人之心去想别人,并不代表别人不以小人之心去想你;你光明正大的做事,不表示别人不会以卑鄙邪恶的言行攻击你
 *
 *	一	虽然自己不会害人,不会陷害人,但也一定要知道别人的心思,最基本的自保之术还是要有的
 *	二	在一个不见刀光血影的环境中,人是不会成长起来的
 *	三	自己的心性能否被磨灭,就要看自己把自己的修炼的如何自强了
 *	四	软弱不是你的错,抛弃软弱,走向自强的道路,是不是被自己堵死了,才是关键
 *	五	不工于心计,但要能够接下
 *	六	杯弓蛇影,草木皆兵,风声鹤唳,疑神疑鬼,含沙射影
 *	七	能否甄别戏言-玩笑话,以及挖苦讽刺的话,也很有趣
 *	八	正视自己的不足,过错;不愤怒别人的攻击,不自卑自己的无知,不忌妒别人的才能,平衡静与动的学问
 *	九	先把自己的事情弄清爽了,再去参考别人的,否则顾此失彼,得不偿失
 *	十	进退法则;先尽心尽力地干好自己的本职工作,涉及自己的业务必须熟练;和别人有交集的地方,多思考解决方案,多沟通
 *
 *	一	不要让自己闲下来,一闲下来就处于空虚的状态,时刻学习中,这是一种潜意识行为;当然人一闲下来就会想那些乱七八糟的事,就会无端滋生是非
 *	二	想到和得到之间还有两字，那就是得【做到】！
 *	三	凡事不会一蹴而就,必定是再三斟酌斟酌,动动你的脑子,权衡之后的一个方案,不过脑子就瞎下结论,别人嘲笑你是个小事,坏了正事,却责任重大
 *	四	编程就是一个你敲了多少代码,你写了多少高质量的代码,你有没有巧妙地运用智慧优化你的代码,避免bug,一切都是你的经验
 *	五	有些话别人自己说着行,从你口中说出来或许就会适得其反,要知道哪些话该说,哪些话不该说,想明白了再说,有把握了再说
 *	六	什么事情都很不在意的样子,往往会错过很多最佳时机,情况甚至会变得更糟;为什么不能很慎重对待那些该严肃的事情,为什么不分清轻重缓急;
 *	七	突然发现自己对什么都没有个规划,没有强烈的好奇心,追求欲;这样如何能行,时间长了,会成个废人,要想清楚了,必须改掉暮气沉沉的自己;学会思考,学会成长;保持旺盛的进取心,求知欲
 *	八	做人要有点幽默感,做到心平气和,再运用一些智慧,配合一下氛围,自然就可以做到了,自然而不做作
 *	十	有些话必须当面想清楚了,而且不要吞吞吐吐,沉默不语,要清清楚楚地说出来告诉对方,特别是涉及利益原则方面的事,彼此都清楚自己在想什么,少一些不必要的猜疑麻烦;有些甚至会坏事
 *
 *	一	别人既然看不起你,说明你身上的确有不好的一面,如果对自己有帮助,而且的确是自己以前不曾发现的问题,那么你就要改过来
 *	二	自己不够积极主动,坐享其成,消极怕事,不敢把问题说出来共同研究;自己不会的说出来没有人会笑你,而且自己也可以提供一些有用的信息
 *	三	大多数情况都是自己不够理性,太过于感性或者是情绪化看问题导致自己把很多事情做的很糟糕;只有一个理性的自己才能够成长起来呀;这种习惯是可以养成的,相信自己,坚持下来吧！
 *	四	学会分享而不是忌妒
 *	五	过度自负就是极度自卑
 *	六	大道至简，躬行深思
 *	七	在自己的专业范围内，岂能浅尝辄止
 *	八	孤傲伴酒生,狂歌梦醉死;曲幽天长别,饮恨地久离
 *	九	萻提本无树,明镜亦非台;本来无一物,何处惹尘埃
 *	十	关汉卿-豆娥冤-词
 *
 *	一	不要把自己的尊严凌驾在别人的尊严之上
 *	二	不要处心积虑狂妄自大的去改造别人，能潜移默化地影响别人向善已经是仁者之范了，君子之行了
 *	三	不要把自己排解不了的苦难郁闷，用恶行恶语来施加到别人身上
 *	四	说自己是个君子没有瑕疵的人，而背后骂人如贱妇，行为如毒蝎的人，吾未见其君子之范也
 *	五	说别人背地里嘀咕，看你笑话，而你自己时时刻刻却如怨妇一样口无遮拦叽叽歪歪，吾未见其善心大德何在也
 *	六	说别人在和你比，而你自己却处处压制别人，把无说成有，把有说成更多，整天疑神疑鬼，乱猜别人心思
 *	七	不要想着自己不说话，就可以什么事都不会发生到自己的头上，就可以置身事外，安然无恙。其实心怀不轨的人已经惦记上你了，你的言行他们都已经刻在心里了，说不定什么时候会狠咬你一口。
 *	八	自己的行为是有不当的地方，那是生活的习惯问题，影响到别人了，可又不是致命的伤害，更不是有心为之；你抓住不放，往死里去整人，还标榜自己是个真君子，唠唠叨叨，哼哼唧唧！
 *	九	谁人不自私，不能容忍别人偶尔的自私，而刻意或者当作习惯式的把自己的自私凌驾在别人身上时，自己不但不反省，反而当作合情合理，理所当然，这是什么逻辑。难道你天生就应该比别人高贵吗，难道别人偶尔的自尊就会杀死你了吗，你为什么会那么仇恨别人
 *	十	沉默寡言，声音细若蚊蝇，不分场合的笑面；这些都是致命的害处，有话有意见，想好了敞亮地说出来；不要求你声如洪钟，至少别人听起来不费劲吧；不合时宜的笑总是会让别人不爽的。
 *
 *	一	什么都不说，什么都不做，比什么都说什么都做的危害性更大
 *	二	把偶然的事件当成是偶然发生的，而不去思考其必然的因素，是一种危险的行为
 *	三	入画 夏末 微凉
 *	四	先学会生存 再享受生活 或者生存大于生活
 *  五	固定思维：一直都在线支付，但钱不够了，我咋不现金支付呢;我的日报文件yangsong.txt每天记录的内容按日期应该是把最近的放在最前面，但由于刚开始内容较少，我顺着从上到下记录，时间久了会有一个问题
 *		每次进来我想最近的修改，还要翻到最后去查看。
 *	六	从幕后到台前，潜意识在阳光下跳跃 | 一旦你把自己潜意识里面的东西从幕后拉出来，你就有了面对并反思它们的可能，而不是任它们在幕后阴险地左右你的思维。
 *	七	系统出现故障，维护，更新，升级中。。。
 *	八	一旦一个人身上的神圣光环消失后，那种天之骄子的优越感荡然无存时，所有的先天优势都成了累赘，反思中。。。
 *	九	还是配置文件重要，改动很小，但对性能或者其他影响很大。不是一两行代码可以搞定的。tomcat服务器的相关配置文件，你都熟悉吗？
 *	十	对自己的工作，抱一种浅尝辄止的态度;从来未有主动去研究清楚其中的细节，只是急于把问题给解决;有时任务即使做完了，也不见得就完事了。当你做的东西出现了错误，下次让你去修复时;或者是有新的需求
 *		需要加到你原有工作上的时候，你又要花大把的时间去看，而且没有考虑上下文









