							Challenge Is Everywhere,What Inspire Your Passion.I strongly feel about that the pursuit of knowledge is my life.
2013-10-21	--->
	攻城狮	程序猿
2013-10-18	--->
1	在这样一个黑白颠倒，是非不分，善恶轮转，真假难辨的时代，你只能做到不怒，不愤，不悲，不动，才能心平气和地去思考							
							
2013-10-16	--->
16  技术无贵贱，不要挑食
	小心“我会在需要的时候再学”
	广度的知识是深入研究的副产品
	和高手工作
	对技术的热情就是不给自己找借口
	挑战无处不在

	人生往往会面对很多选择，陈皓告诉广大程序员：
	户口、薪资，相比你的人生经历，你的眼界，你的发展，什么都不是
	眼界和经历最重要，价值并不仅仅是名利权
	和有激情能做事的人做有意义的事

	在最后陈皓给了大家三个思考：=== :》
	早晨，是什么驱动着你开始新的一天?
	你现在正在经历的有没有让你感到兴奋?
	你经历过的有没有让你觉得没有荒度?

15	你没有能力就想着整个天翻地覆，有能力了，岂不要毁灭整个宇宙;做人的思维可以很复杂，但千万记得不要太张狂，目中无人，一极而终！
	程序猿，攻城狮，挨踢民工
14	俞敏洪 致青春 	青春其实跟三个“想”有关，叫做理想、梦想和思想。
13	工具就是拿来用的，或许我并不必要每次都关心其内部构造如何，这样可以避开很多问题;可以提升开发效率。
	有些工具涉及到核心问题，有研究的价值，那我们不妨潜心探索一番
	事情不在正确的轨道上运行时，会出大错了，控制不住的局面必然到来。。。
12	北三环园子里奏响了史诗般的合唱;南三环林子里叽叽喳喳的小鸟却闹个不停
11	分类比较清晰，导致一些数据的冗余;有时自己分类不清，似乎也达到一种简洁，自己很明白，逻辑也没有错，但别人调试起来会很费劲;	
	这两种情况的存在，各有优劣，显然前一种较胜。不过寻找一种折中的方案会更好。。。脑子不清晰时，是不会朝这个方向去想的。程序员编程时应有的一种敏感及良好习惯，这也是区分新手和老手的地方呢
10	要不学，那你就要玩得开心;要学，就要拿出十二分的激情来，有所反思，有所收获的学;要让时间过得充实，有价值
	寒霜易降，野露难眠
9	蝴蝶梦	武侠梦	知识分子的傲骨侠骨	活在自我陶醉的迷梦中	是有那么多好经典的传神的优质的深厚的超越了某些东西的不可模仿的古人的已经积淀了的亘古不变的精神本质的文化精髓基因传承了
	却没有去发掘借助现代科技和特效，外在的形式变了，是满足人心理的需求，内存的伟大的东西如果丧失了，再美也会遗失
	你不去做，你的子孙后代不去做，总活在自欺欺人的满足优越感中，被别人借鉴去，盗窃去，以另一种恢宏的大气的史诗般的内容画面去征服了世界，而不仅仅是自己人
	大唐何以成为世界的中心	今天的美国或许可以窥其一二
	江湖	森林法则
	各种思想流 意识流的一种激荡 需要各种知识，见闻，经历来激发碰撞
	你的价值就是与众不同，全新的自我，该如何重塑，如何开始，寻找不同的方向，不同的感觉
	看有道云笔记如何消除消息怪兽
	商战的背后有哪些逻辑，一次国企与民企的交锋，一次垄断与自由的碰撞，一次开放与禁锢的较量，市场不能由某种单一的力量去主导，否则会失去其应有的活力和价值，自由和公正	
8	中国移动-大象，移动速度慢，转向迟缓;而移动互联网公司求新，求快，求变;不作出改变，只有死路一条，顺应时代的大潮流，才能有所作为;这是一个移动互联的疯狂时代，弱肉强食的时代;需要疯子的存在，非洲
	草原法则，有没有灵敏的嗅觉，有没有矫健的身形，有没有强大的力量，有没有足够的智慧，都决定着你先人一步还是慢人一拍，得意，失意，就这么个逻辑
7	不仅仅是，而且会是;能行的更远，为何要固步自封	
6	深海孤独，蛟龙腾渊
5	道和术的逻辑，满眼看到的都是术，乱象了你的视野，混浊了你的记忆;其实隐藏更深也最为玄妙的当属道，道法自然，道生一，一生二，二生三，三生万物，这才是根源。如果想问题能有这样一个思维情景，似乎又
	清晰了更多。。。
4	现在能把一个问题讲得那么清晰明了的人物，似乎已经很少了，然而就是很少的这批人成就了大师，牛人。。。
	一个问题的前世今生，来源归去，探究的如此详尽，预测的如此精准，当佩服欲绝
3	每当走到这一步，回过头来，其实发现一个结论性的东西------那就是问题越讨论越清晰，越分越细，越思考越明白，分化有时看来是一件很有意义的事情
	让我想到思维导图这个工具里面隐藏的某些含义，似乎也在此吧------那种爆炸性的，发散式的，看似毫不关联的，总会找到一个因缘起点，有趣的是你不曾相信的事物或者逻辑出现了，
	它们在某个点上交叉碰撞出火花了，一些新鲜的事物到来了。。。
	有时候，人类社会所谓的阶级分化，君君臣臣，高贵低贱这些罪恶的毒瘤，在万事万物身上都有其体现，是根植于其基因中的，剔除不掉的东西，只有接受，趋利避害，积极作为
	是也，编程中也可窥其一斑，在不同的场景中，各组件之间要想协调一致的工作，必须各司其职，分工明确，谁被谁控制，信息流交给谁处理，是不能乱掉的，惟如此，方能程序运行稳定，实现一个大圆满，大和谐
2	清除缓存这一操作在代码里的位置及时机不对，会带来很多意想不到的问题	
1	假设 + 条件分枝 = 思考过程 【假设充分不充分，有没有根据？条件分枝清晰不清晰，全面不全面？】


2013-10-01 before	--->

 *	一	条分缕析
 *	二  凡事都有分枝,脉络,能否用心,专心剖析,把其来龙去脉,看清楚,是一个人最基本的能力
 *	三	分的思想 - 微积分 - 阴阳论
 *	四	有时一叶障目,却易执迷不悟;不识庐山真面目,只缘身在此山中;有跳出某个点,看整体的意识
 *	五	研究一个所说的话,很有意思;三句不离老本行,所说反映其所思,更反映其所长;太多人都在讨论对别人的看法,而且一本正经,仿佛自己是专家权威
 *	六	当然有些人喜欢谈论赚钱之道,谈自己如何厉害,如何鄙视别人的无知无能,没有远见思考
 *	七	只要稍微用点心,朝别的方向考虑一下,就会有新鲜的发现
 *	八	有人喜静,有人好动;有人喜欢吹嘘,有人保持低调;有人激情高涨,热衷于玩弄权谋,与人争与已争;有人看不透世俗,却被卷进权谋,沦为棋子
 *	九	人与人的交往已经不再单纯,必有利益驱使;奸诈阴险之嘴脸暗藏其后;防人害人之心常有之,暗箭冷雨防不胜防;
 *	十	你不以小人之心去想别人,并不代表别人不以小人之心去想你;你光明正大的做事,不表示别人不会以卑鄙邪恶的言行攻击你
 *	
 *	一	虽然自己不会害人,不会陷害人,但也一定要知道别人的心思,最基本的自保之术还是要有的
 *	二	在一个不见刀光血影的环境中,人是不会成长起来的
 *	三	自己的心性能否被磨灭,就要看自己把自己的修炼的如何自强了
 *	四	软弱不是你的错,抛弃软弱,走向自强的道路,是不是被自己堵死了,才是关键
 *	五	不工于心计,但要能够接下
 *	六	杯弓蛇影,草木皆兵,风声鹤唳,疑神疑鬼,含沙射影
 *	七	能否甄别戏言-玩笑话,以及挖苦讽刺的话,也很有趣
 *	八	正视自己的不足,过错;不愤怒别人的攻击,不自卑自己的无知,不忌妒别人的才能,平衡静与动的学问
 *	九	先把自己的事情弄清爽了,再去参考别人的,否则顾此失彼,得不偿失
 *	十	进退法则;先尽心尽力地干好自己的本职工作,涉及自己的业务必须熟练;和别人有交集的地方,多思考解决方案,多沟通
 *
 *	一	不要让自己闲下来,一闲下来就处于空虚的状态,时刻学习中,这是一种潜意识行为;当然人一闲下来就会想那些乱七八糟的事,就会无端滋生是非
 *	二	想到和得到之间还有两字，那就是得【做到】！
 *	三	凡事不会一蹴而就,必定是再三斟酌斟酌,动动你的脑子,权衡之后的一个方案,不过脑子就瞎下结论,别人嘲笑你是个小事,坏了正事,却责任重大
 *	四	编程就是一个你敲了多少代码,你写了多少高质量的代码,你有没有巧妙地运用智慧优化你的代码,避免bug,一切都是你的经验
 *	五	有些话别人自己说着行,从你口中说出来或许就会适得其反,要知道哪些话该说,哪些话不该说,想明白了再说,有把握了再说
 *	六	什么事情都很不在意的样子,往往会错过很多最佳时机,情况甚至会变得更糟;为什么不能很慎重对待那些该严肃的事情,为什么不分清轻重缓急;
 *	七	突然发现自己对什么都没有个规划,没有强烈的好奇心,追求欲;这样如何能行,时间长了,会成个废人,要想清楚了,必须改掉暮气沉沉的自己;学会思考,学会成长;保持旺盛的进取心,求知欲
 *	八	做人要有点幽默感,做到心平气和,再运用一些智慧,配合一下氛围,自然就可以做到了,自然而不做作
 *	十	有些话必须当面想清楚了,而且不要吞吞吐吐,沉默不语,要清清楚楚地说出来告诉对方,特别是涉及利益原则方面的事,彼此都清楚自己在想什么,少一些不必要的猜疑麻烦;有些甚至会坏事
 *
 *	一	别人既然看不起你,说明你身上的确有不好的一面,如果对自己有帮助,而且的确是自己以前不曾发现的问题,那么你就要改过来
 *	二	自己不够积极主动,坐享其成,消极怕事,不敢把问题说出来共同研究;自己不会的说出来没有人会笑你,而且自己也可以提供一些有用的信息
 *	三	大多数情况都是自己不够理性,太过于感性或者是情绪化看问题导致自己把很多事情做的很糟糕;只有一个理性的自己才能够成长起来呀;这种习惯是可以养成的,相信自己,坚持下来吧！
 *	四	学会分享而不是忌妒
 *	五	过度自负就是极度自卑
 *	六	大道至简，躬行深思
 *	七	在自己的专业范围内，岂能浅尝辄止
 *	八	孤傲伴酒生,狂歌梦醉死;曲幽天长别,饮恨地久离
 *	九	萻提本无树,明镜亦非台;本来无一物,何处惹尘埃
 *	十	关汉卿-豆娥冤-词
 *
 *	一	不要把自己的尊严凌驾在别人的尊严之上
 *	二	不要处心积虑狂妄自大的去改造别人，能潜移默化地影响别人向善已经是仁者之范了，君子之行了
 *	三	不要把自己排解不了的苦难郁闷，用恶行恶语来施加到别人身上
 *	四	说自己是个君子没有瑕疵的人，而背后骂人如贱妇，行为如毒蝎的人，吾未见其君子之范也
 *	五	说别人背地里嘀咕，看你笑话，而你自己时时刻刻却如怨妇一样口无遮拦叽叽歪歪，吾未见其善心大德何在也
 *	六	说别人在和你比，而你自己却处处压制别人，把无说成有，把有说成更多，整天疑神疑鬼，乱猜别人心思
 *	七	不要想着自己不说话，就可以什么事都不会发生到自己的头上，就可以置身事外，安然无恙。其实心怀不轨的人已经惦记上你了，你的言行他们都已经刻在心里了，说不定什么时候会狠咬你一口。
 *	八	自己的行为是有不当的地方，那是生活的习惯问题，影响到别人了，可又不是致命的伤害，更不是有心为之；你抓住不放，往死里去整人，还标榜自己是个真君子，唠唠叨叨，哼哼唧唧！
 *	九	谁人不自私，不能容忍别人偶尔的自私，而刻意或者当作习惯式的把自己的自私凌驾在别人身上时，自己不但不反省，反而当作合情合理，理所当然，这是什么逻辑。难道你天生就应该比别人高贵吗，难道别人偶尔的自尊就会杀死你了吗，你为什么会那么仇恨别人
 *	十	沉默寡言，声音细若蚊蝇，不分场合的笑面；这些都是致命的害处，有话有意见，想好了敞亮地说出来；不要求你声如洪钟，至少别人听起来不费劲吧；不合时宜的笑总是会让别人不爽的。
 *
 *	一	什么都不说，什么都不做，比什么都说什么都做的危害性更大
 *	二	把偶然的事件当成是偶然发生的，而不去思考其必然的因素，是一种危险的行为
 *	三	入画 夏末 微凉
 *	四	先学会生存 再享受生活 或者生存大于生活
 *  五	固定思维：一直都在线支付，但钱不够了，我咋不现金支付呢;我的日报文件yangsong.txt每天记录的内容按日期应该是把最近的放在最前面，但由于刚开始内容较少，我顺着从上到下记录，时间久了会有一个问题
 *		每次进来我想最近的修改，还要翻到最后去查看。
 *	六	从幕后到台前，潜意识在阳光下跳跃 | 一旦你把自己潜意识里面的东西从幕后拉出来，你就有了面对并反思它们的可能，而不是任它们在幕后阴险地左右你的思维。
 *	七	系统出现故障，维护，更新，升级中。。。
 *	八	一旦一个人身上的神圣光环消失后，那种天之骄子的优越感荡然无存时，所有的先天优势都成了累赘，反思中。。。
 *	九	还是配置文件重要，改动很小，但对性能或者其他影响很大。不是一两行代码可以搞定的。tomcat服务器的相关配置文件，你都熟悉吗？
 *	十	对自己的工作，抱一种浅尝辄止的态度;从来未有主动去研究清楚其中的细节，只是急于把问题给解决;有时任务即使做完了，也不见得就完事了。当你做的东西出现了错误，下次让你去修复时;或者是有新的需求
 *		需要加到你原有工作上的时候，你又要花大把的时间去看，而且没有fth







	
	
